---
type: IFCExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 12
tags: [revit-api, class]
---

# IFCExportOptions

`Autodesk.Revit.DB.IFCExportOptions` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IFCExportOptions | — | `` |
| Constructor | IFCExportOptions | 2011 | `public IFCExportOptions ()` |
| Method | AddOption | 2013 | `public void AddOption ( string name , string value )` |
| Method | Assign | 2011 | `public void Assign ( IFCExportOptions sourceOptions )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | ExportBaseQuantities | 2011 | `public bool ExportBaseQuantities { get ; set ; }` |
| Property | FamilyMappingFile | 2011 | `public string FamilyMappingFile { get ; set ; }` |
| Property | FileVersion | 2011 | `public IFCVersion FileVersion { get ; set ; }` |
| Property | FilterViewId | 2011 | `public ElementId FilterViewId { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | SpaceBoundaryLevel | 2011 | `public int SpaceBoundaryLevel { get ; set ; }` |
| Property | WallAndColumnSplitting | 2011 | `public bool WallAndColumnSplitting { get ; set ; }` |